Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: Quickstart: Building with Bazel
it_it: Quickstart: Il Building con Bazel

source: Quickstart: Building with CMake
it_it: Quickstart: Il Building con CMake

source: Quiz time!
it_it: Tempo di quiz!

source: Read the Google TestPrimer to get started with the Google C++ Testing Framework.
it_it: Leggi Google TestPrimer per iniziare a utilizzare il framework di test di Google C++.

source: Read this first if you are new to GoogleTest.
it_it: I principianti dovrebbero cominciare da qui.

source: Recall that flags are saved before running each test and restored afterwards, so you need not do that yourself.
it_it: Ricordarsi che i flag vengono salvati prima di eseguire ciascun test e ripristinati alla fine, quindi non è necessario farlo esplicitamente.

source: Recommended if overriding a virtual method.
it_it: Consigliato se si sovrascrive [override] un metodo virtual.

source: Recommended if overriding a `virtual` method.
it_it: Consigliato se si sovrascrive un metodo `virtual`.

source: References
it_it: Riferimenti

source: References:
it_it: Riferimenti:

source: Regarding the tip on mixing a mock and a fake, here's an example on why it may be a bad sign: Suppose you have a class System for low-level system operations.
it_it: Per quanto riguarda il suggerimento su come mescolare un mock e un fake, ecco un esempio del perché potrebbe essere un brutto segno: supponiamo di avere una classe System per operazioni di sistema di basso livello.

source: Regarding the tip on mixing a mock and a fake, here's an example on why it may be a bad sign: Suppose you have a class `System` for low-level system operations.
it_it: Per quanto riguarda il suggerimento su come mescolare un mock e un fake, ecco un esempio del perché potrebbe essere un brutto segno: supponiamo di avere una classe `System` per operazioni di sistema di basso livello.

source: Registering tests programmatically
it_it: Registrazione dei test programmaticamente

source: Registers the type-parameterized tests *`TestNames...`* of the test suite *`TestSuiteName`*.
it_it: Registra i test con tipi parametrizzati *`TestNames...`* della test suite *`TestSuiteName`*.

source: Registers the type-parameterized tests TestNames... of the test suite TestSuiteName.
it_it: Registra i test con tipi parametrizzati TestNames... della test suite TestSuiteName.

source: Regular Expression Syntax
it_it: Sintassi delle Espressioni Regolari

source: Related to the assertions SUCCEED() and FAIL(), you can prevent further test execution at runtime with the GTEST_SKIP() macro.
it_it: Per quanto riguarda le asserzioni SUCCEED() e FAIL(), si può evitare l'esecuzione dei test successivi a runtime con la macro GTEST_SKIP().

source: Related to the assertions `SUCCEED()` and `FAIL()`, you can prevent further test execution at runtime with the `GTEST_SKIP()` macro.
it_it: Per quanto riguarda le asserzioni `SUCCEED()` e `FAIL()`, si può evitare l'esecuzione dei test successivi a runtime con la macro `GTEST_SKIP()`.

source: Remember that there are AllOf() and AllOfArray().
it_it: Si ricorda che ci sono AllOf() e AllOfArray().

source: Remember that namespaces are a good idea.
it_it: Ricordarsi che i namespace sono una buona idea.

source: Remember that _ is the wildcard matcher that matches anything.
it_it: Da tener presente che _ è il carattere jolly che corrisponde a "qualsiasi cosa".

source: Remember that `_` is the wildcard matcher that matches anything.
it_it: Da tener presente che `_` è il carattere jolly che corrisponde a "qualsiasi cosa".

source: Remember that a mock object doesn't really have a working implementation?
it_it: Ci si ricorda che un oggetto mock non ha in realtà un'implementazione funzionante?

source: Remember that function objects created with AsStdFunction() are just forwarders.
it_it: Da ricordare che gli oggetti funzione creati con AsStdFunction() sono solo [forwarder].

source: Remember that function objects created with `AsStdFunction()` are just forwarders.
it_it: Da ricordare che gli oggetti funzione creati con `AsStdFunction()` vengono solo [forwarder].

source: Remember that one WillOnce() clause will be consumed each time the function is invoked and the default action will be taken afterwards.
it_it: Ricordarsi che una clausola WillOnce() verrà utilizzata ogni volta che la funzione viene invocata e successivamente verrà eseguita l'azione di default.

source: Remember that one `WillOnce()` clause will be consumed each time the function is invoked and the default action will be taken afterwards.
it_it: Ricordarsi che una clausola `WillOnce()` verrà utilizzata ogni volta che la funzione viene invocata e successivamente verrà eseguita l'azione di default.

source: Remember that talk about tests being too rigid?
it_it: Ricordate quando si parlava di test troppo rigidi?

source: Remember that the test order is undefined, so your code can't depend on a test preceding or following another.
it_it: Da ricordare che l'ordine dei test non è definito, quindi il codice non può dipendere da un test che ne precede o ne segue un altro.

source: Remember that there are [`AllOf()` and `AllOfArray()`](#CombiningMatchers).
it_it: Si ricorda che ci sono [`AllOf()` e `AllOfArray()`](#CombiningMatchers).

source: Remember the steps for using a mock:
it_it: Si ricordano i passaggi per utilizzare un mock:

source: Remember to derive it from ::testing::Test:
it_it: Ricordarsi di derivarlo da ::testing::Test:

source: Remember to derive it from `::testing::Test`:
it_it: Ricordarsi di derivarlo da `::testing::Test`:

source: Remember to pick unique prefixes for different instances.
it_it: Ricordarsi di scegliere prefissi univoci per istanze diverse.

source: Remember to pick unique prefixes for different instantiations.
it_it: Ricordarsi di scegliere prefissi univoci per le diverse istanze.

source: Remember: if you do this, don't change bar after the EXPECT_CALL(), or the result is undefined.
it_it: Da ricordare: se lo si fa, non modificare bar dopo la EXPECT_CALL(), altrimenti il risultato non sarà definito.

source: Remember: if you do this, don't change `bar` after the `EXPECT_CALL()`, or the result is undefined.
it_it: Da ricordare: se lo si fa, non modificare `bar` dopo la `EXPECT_CALL()`, altrimenti il risultato non sarà definito.

source: Removes the given event listener from the list and returns it.
it_it: Rimuove il listener di eventi specificato dall'elenco e lo restituisce.

source: Repeat until all virtual functions you want to mock are done.
it_it: Si ripete per tutte le funzioni virtuali da simulare (mock-are).

source: Repeating the Tests
it_it: Ripetizione dei Test

source: Repeats the above steps for the next test, until all tests have run.
it_it: Ripete i passaggi precedenti per il test successivo, fino all'esecuzione di tutti i test.

source: Represents a chronological sequence of expectations.
it_it: Rappresenta una sequenza cronologica di expectation.

source: Represents a global test environment.
it_it: Rappresenta un ambiente di test globale.

source: Represents a list of types for use in typed tests and type-parameterized tests.
it_it: Rappresenta un elenco di tipi da utilizzare nei test tipizzati e nei test con tipi parametrizzati.

source: Represents a mock function call expectation as created by EXPECT_CALL:
it_it: Rappresenta una expectation di chiamata a mock creata da EXPECT_CALL:

source: Represents a mock function call expectation as created by [`EXPECT_CALL`](#EXPECT_CALL):
it_it: Rappresenta una expectation di chiamata a mock creata da [`EXPECT_CALL`](#EXPECT_CALL):

source: Represents a mock object that generates test failures on uninteresting calls.
it_it: Rappresenta un oggetto mock che genera fallimenti dei test sulle chiamate uninteresting.

source: Represents a mock object that generates test failures on [uninteresting calls](../gmock_cook_book.md#uninteresting-vs-unexpected).
it_it: Rappresenta un oggetto mock che fallimenti errori sulle [chiamate uninteresting](../gmock_cook_book.md#uninteresting-vs-unexpected).

source: Represents a mock object that generates warnings on uninteresting calls.
it_it: Rappresenta un mock fittizio che genera warning su chiamate uninteresting.

source: Represents a mock object that generates warnings on [uninteresting calls](../gmock_cook_book.md#uninteresting-vs-unexpected).
it_it: Rappresenta un oggetto mock che genera warning sulle [chiamate uninteresting](../gmock_cook_book.md#uninteresting-vs-unexpected).

source: Represents a mock object that suppresses warnings on uninteresting calls.
it_it: Rappresenta un oggetto mock che sopprime i warning sulle chiamate uninteresting.

source: Represents a mock object that suppresses warnings on [uninteresting calls](../gmock_cook_book.md#uninteresting-vs-unexpected).
it_it: Rappresenta un oggetto mock che sopprime i warning sulle [chiamate uninteresting](../gmock_cook_book.md#uninteresting-vs-unexpected).

source: Represents a set of mock function call expectations.
it_it: Rappresenta un insieme di expectation di chiamate a funzione mock.

source: Represents a test suite.
it_it: Rappresenta una test suite.

source: Required if overriding a const method.
it_it: Obbligatorio se si sovrascrive [override] un metodo const.

source: Required if overriding a noexcept method.
it_it: Obbligatorio se si sovrascrive un metodo noexcept.

source: Required if overriding a `const` method.
it_it: Obbligatorio se si "override" un metodo `const`.

source: Required if overriding a `noexcept` method.
it_it: Obbligatorio se si sovrascrive un metodo `noexcept`.

source: Required if overriding a method that has a reference qualifier.
it_it: Obbligatorio se si esegue l'override di un metodo che dispone di un qualificatore di riferimento.

source: Required if overriding a method that has reference qualifications.
it_it: Obbligatorio se si esegue l'override di un metodo che dispone di qualifiche dei riferimenti.

source: Requires a modifier clause to specify the method's behavior.
it_it: Richiede un modificatore di clausola per specificare il comportamento del metodo.

source: Resources
it_it: Risorse

source: Rest assured that your code is type-safe though: you'll get a compiler error if *arg1 doesn't support the ++ operator, or if the type of ++(*arg1) isn't compatible with the mock function's return type.
it_it: Sicuramente il codice è type-safe: si riceverà un errore del compilatore se *arg1 non supporta l'operatore ++, o se il tipo di ++(*arg1) non è compatibile con il tipo restituito della funzione mock.

source: Rest assured that your code is type-safe though: you'll get a compiler error if `*arg1` doesn't support the `++` operator, or if the type of `++(*arg1)` isn't compatible with the mock function's return type.
it_it: Sicuramente il codice è type-safe: si riceverà un errore del compilatore se `*arg1` non supporta l'operatore `++`, o se il tipo di `++(*arg1)` non è compatibile con il tipo restituito della funzione mock.

source: Restores the state of all GoogleTest flags.
it_it: Ripristina lo stato di tutti i flag di GoogleTest.

source: Restricting the Type of an Argument or Parameter in an ACTION
it_it: Restrizioni sul tipo dell'argomento o del parametro in una ACTION

source: Restricts the expectation to apply only to mock function calls whose arguments as a whole match the multi-argument matcher multi_argument_matcher.
it_it: Limita expectation ad applicarsi solo alle chiamate di funzione mock i cui argomenti nel complesso corrispondono al matcher multi-argomento multi_argument_matcher.

source: Restricts the expectation to apply only to mock function calls whose arguments as a whole match the multi-argument matcher *`multi_argument_matcher`*.
it_it: Limita expectation ad applicarsi solo alle chiamate di funzione mock i cui argomenti nel complesso corrispondono al matcher multi-argomento *`multi_argument_matcher`*.

source: Restricts the specification to only mock function calls whose arguments as a whole match the multi-argument matcher multi_argument_matcher.
it_it: Limita la specifica solo alle chiamate di funzione mock i cui argomenti nel complesso corrispondono al matcher multi-argomento multi_argument_matcher.

source: Restricts the specification to only mock function calls whose arguments as a whole match the multi-argument matcher *`multi_argument_matcher`*.
it_it: Limita la specifica solo alle chiamate di funzione mock i cui argomenti nel complesso corrispondono al matcher multi-argomento *`multi_argument_matcher`*.

source: Result is the return type of function type
it_it: Result è il tipo restituito della funzione di tipo

source: Return new T(a1, ..., ak); a different object is created each time.
it_it: Restituisce new T(a1, ..., ak); ogni volta viene creato un oggetto diverso.

source: Return value.
it_it: Restituisce value.

source: Return `new T(a1, ..., ak)`; a different object is created each time.
it_it: Restituisce `new T(a1, ..., ak)`; ogni volta viene creato un oggetto diverso.

source: Return `value`.
it_it: Restituisce `value`.

source: Return a null pointer.
it_it: Restituisce un puntatore null.

source: Return a reference to variable.
it_it: Restituisce un riferimento alla variable.

source: Return a reference to `variable`.
it_it: Restituisce un riferimento alla `variable`.

source: Return a reference to a copy of value; the copy lives as long as the action.
it_it: Restituisce un riferimento a una copia di value; la copia vive quanto l'azione.

source: Return a reference to a copy of `value`; the copy lives as long as the action.
it_it: Restituisce un riferimento a una copia di `value`; la copia vive quanto l'azione.

source: Return from a void mock function.
it_it: Ritorno da una funzione mockvoid.

source: Return from a `void` mock function.
it_it: Ritorno da una funzione mock `void`.

source: Return the N-th (0-based) argument.
it_it: Restituisce l'argomento N-esimo (in base 0).

source: Return the `N`-th (0-based) argument.
it_it: Restituisce l'argomento `N`-esimo (in base 0).

source: Return the value pointed to by ptr.
it_it: Restituisce il valore puntato da ptr.

source: Return the value pointed to by `ptr`.
it_it: Restituisce il valore puntato da `ptr`.

source: Returning Live Values from Mock Methods
it_it: Restituire Valori Live dai Metodi Mock

source: Returning References from Mock Methods
it_it: Restituire Riferimenti dai Metodi Mock

source: Returning a Value
it_it: Restituzione di un Valore

source: Returns NULL if the listener is not found in the list.
it_it: Restituisce NULL se il listener non viene trovato nell'elenco.

source: Returns `NULL` if the listener is not found in the list.
it_it: Restituisce `NULL` se il listener non viene trovato nell'elenco.

source: Returns the TestInfo for the i-th test among all the tests.
it_it: Restituisce la TestInfo per l'i-esimo test tra tutti i test.

source: Returns the TestInfo object for the test that's currently running, or NULL if no test is running.
it_it: Restituisce l'oggetto TestInfo per il test attualmente in esecuzione o NULL se non è in esecuzione alcun test.

source: Returns the TestPartResult for the i-th test part result among all the results.
it_it: Restituisce la TestPartResult per l'i-esimo risultato della parte di test tra tutti i risultati.

source: Returns the TestProperty object for the i-th test property.
it_it: Restituisce l'oggetto TestProperty per l'i-esima proprietà del test.

source: Returns the TestResult containing information on test failures and properties logged outside of individual test suites.
it_it: Restituisce il TestResult contenente informazioni sugli errori dei test e sulle proprietà loggate all'esterno delle singole test suite.

source: Returns the TestResult that holds test properties recorded during execution of SetUpTestSuite and TearDownTestSuite.
it_it: Restituisce il TestResult che contiene le proprietà di test registrate durante l'esecuzione di SetUpTestSuite e TearDownTestSuite.

source: Returns the TestSuite object for the test that's currently running, or NULL if no test is running.
it_it: Restituisce l'oggetto TestSuite per il test attualmente in esecuzione o NULL se non è in esecuzione alcun test.

source: Returns the [`TestInfo`](#TestInfo) for the `i`-th test among all the tests.
it_it: Restituisce la [`TestInfo`](#TestInfo) per l'`i`-esimo test tra tutti i test.

source: Returns the [`TestInfo`](#TestInfo) object for the test that's currently running, or `NULL` if no test is running.
it_it: Restituisce l'oggetto [`TestInfo`](#TestInfo) per il test attualmente in esecuzione o `NULL` se non è in esecuzione alcun test.

source: Returns the [`TestPartResult`](#TestPartResult) for the `i`-th test part result among all the results.
it_it: Restituisce la [`TestPartResult`](#TestPartResult) per l'`i`-esimo risultato della parte di test tra tutti i risultati.

source: Returns the [`TestProperty`](#TestProperty) object for the `i`-th test property.
it_it: Restituisce l'oggetto [`TestProperty`](#TestProperty) per l'`i`-esima proprietà del test.

source: Returns the [`TestResult`](#TestResult) containing information on test failures and properties logged outside of individual test suites.
it_it: Restituisce il [`TestResult`](#TestResult) contenente informazioni sugli errori dei test e sulle proprietà loggate all'esterno delle singole test suite.

source: Returns the [`TestResult`](#TestResult) that holds test properties recorded during execution of `SetUpTestSuite` and `TearDownTestSuite`.
it_it: Restituisce il [`TestResult`](#TestResult) che contiene le proprietà di test registrate durante l'esecuzione di `SetUpTestSuite` e `TearDownTestSuite`.

source: Returns the [`TestSuite`](#TestSuite) object for the test that's currently running, or `NULL` if no test is running.
it_it: Restituisce l'oggetto [`TestSuite`](#TestSuite) per il test attualmente in esecuzione o `NULL` se non è in esecuzione alcun test.

source: Returns the elapsed time, in milliseconds.
it_it: Restituisce il tempo trascorso, in millisecondi.

source: Returns the file name where this test is defined.
it_it: Restituisce il nome del file in cui è definito questo test.

source: Returns the line where this test is defined.
it_it: Restituisce la riga in cui è definito questo test.

source: Returns the list of event listeners that can be used to track events inside GoogleTest.
it_it: Restituisce l'elenco dei listener degli eventi utilizzabili per tenere traccia degli eventi all'interno di GoogleTest.

source: Returns the name of the parameter type, or NULL if this is not a typed or type-parameterized test suite.
it_it: Restituisce il nome del tipo di parametro o NULL se non si tratta di una test suite tipizzata o con tipi parametrizzati.

source: Returns the name of the parameter type, or NULL if this is not a typed or type-parameterized test.
it_it: Restituisce il nome del tipo di parametro o NULL se non si tratta di un test tipizzato o con tipi parametrizzati.

source: Returns the name of the parameter type, or `NULL` if this is not a typed or type-parameterized test suite.
it_it: Restituisce il nome del tipo di parametro o `NULL` se non si tratta di una test suite tipizzata o con tipi parametrizzati.

source: Returns the name of the parameter type, or `NULL` if this is not a typed or type-parameterized test.
it_it: Restituisce il nome del tipo di parametro o `NULL` se non si tratta di un test tipizzato o con tipi parametrizzati.

source: Returns the number of test properties.
it_it: Restituisce il numero di proprietà dei test.

source: Returns the random seed used at the start of the current test run.
it_it: Restituisce il seme random utilizzato all'inizio dell'esecuzione del test corrente.

source: Returns the result of the test.
it_it: Restituisce il risultato del test.

source: Returns the standard listener responsible for the default XML output controlled by the --gtest_output=xml flag.
it_it: Restituisce il listener standard responsabile dell'output XML di default controllato dal flag --gtest_output=xml.

source: Returns the standard listener responsible for the default XML output controlled by the `--gtest_output=xml` flag.
it_it: Restituisce il listener standard responsabile dell'output XML di default controllato dal flag `--gtest_output=xml`.

source: Returns the standard listener responsible for the default console output.
it_it: Restituisce il listener standard responsabile dell'output della console di default.

source: Returns the test name.
it_it: Restituisce il nome del test.

source: Returns the test suite name.
it_it: Restituisce il nome della test suite.

source: Returns the text representation of the value parameter, or NULL if this is not a value-parameterized test.
it_it: Restituisce la rappresentazione testuale del parametro valore o NULL se non si tratta di un test con valori parametrizzati.

source: Returns the text representation of the value parameter, or `NULL` if this is not a value-parameterized test.
it_it: Restituisce la rappresentazione testuale del parametro valore o `NULL` se non si tratta di un test con valori parametrizzati.

source: Returns the working directory when the first TEST() or TEST_F() was executed.
it_it: Restituisce la directory di lavoro quando è stato eseguito il primo TEST() o TEST_F().

source: Returns the working directory when the first [`TEST()`](#TEST) or [`TEST_F()`](#TEST_F) was executed.
it_it: Restituisce la directory di lavoro quando è stato eseguito il primo [`TEST()`](#TEST) o [`TEST_F()`](#TEST_F) was executed.

source: Returns true if and only if the current test has a fatal failure.
it_it: Restituisce true se e solo se il test corrente ha un fallimento fatale.

source: Returns true if and only if the current test has a nonfatal failure.
it_it: Restituisce true se e solo se il test corrente ha un fallimento non fatale.

source: Returns true if and only if the current test has any failure, either fatal or nonfatal.
it_it: restituisce true se e solo se il test corrente ha un qualsiasi fallimento, fatale o meno.

source: Returns true if and only if the current test was skipped.
it_it: Restituisce true se e solo se il test corrente è stato saltato [skip].

source: Returns true if and only if the test failed.
it_it: Restituisce true se e solo se il test è è fallito.

source: Returns true if and only if the test fatally failed.
it_it: Restituisce true se e solo se il test è fallito fatalmente.

source: Returns true if and only if the test has a non-fatal failure.
it_it: Restituisce true se e solo se il test è fallito non fatalmente.

source: Returns true if and only if the test part failed.
it_it: Restituisce true se e solo se la parte del test ha fallito.

source: Returns true if and only if the test part fatally failed.
it_it: Restituisce true se e solo se la parte del test ha fallito fatalmente.

source: Returns true if and only if the test part non-fatally failed.
it_it: Restituisce true se e solo se la parte del test ha fallito in modo non fatale.

source: Returns true if and only if the test part passed.
it_it: Restituisce true se e solo se la parte del test è stata superata.

source: Returns true if and only if the test part was skipped.
it_it: Restituisce true se e solo se la parte del test è stata saltata [skip].

source: Returns true if and only if the test passed (i.e. no test part failed).
it_it: Restituisce true se e solo se il test è stato superato (ovvero nessuna parte del test ha fallito).

source: Returns true if and only if the test suite failed.
it_it: Restituisce true se e solo se la test suite ha fallito.

source: Returns true if and only if the test suite passed.
it_it: Restituisce true se e solo se la test suite è stata superata.

source: Returns true if and only if the test was skipped.
it_it: Restituisce true se e solo se il test è stato saltato [skip].
